xbenkozx/RAZ-RE/Firmware/keil-mdk/firmware/CMSIS/device/n32g031.h
/********************  Bit definition for CRC16_CR register  ********************/
#define CRC16_CTRL_LITTLE ((uint8_t)0x02)
#define CRC16_CTRL_BIG    ((uint8_t)0xFD)

#define CRC16_CTRL_RESET    ((uint8_t)0x04)
#define CRC16_CTRL_NO_RESET ((uint8_t)0xFB)

/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for PWR_CTRL register  ********************/
#define PWR_CTRL_PDSTP                       ((uint16_t)0x0002)     /*!<  low power mode entered select,Power down or STOP*/
#define PWR_CTRL_PD                           ((uint16_t)0x0002)     /*!<  low power mode entered select,Power down */
#define PWR_CTRL_STOP                         ((uint16_t)0x0000)     /*!<  low power mode entered select STOP*/
#define PWR_CTRL_CLRWKUPF                     ((uint16_t)0x0004)     /*!< clear wakeup state flag */
#define PWR_CTRL_CLRDBGPDF                    ((uint16_t)0x0008)     /*!< clear DBGPD state flag  */

#define PLS_OFFSET (5)
#define PWR_CTRL_PVDEN                        ((uint16_t)0x0010)     /*!< Power voltage detector enable */

#define PWR_CTRL_PLS                          ((uint16_t)0x01E0)     /*!< voltage threshold level ,a total 16 gears. Range: 1.8 ~ 5V ,one step need add 200mv */
#define PWR_CTRL_PLS0                         ((uint16_t)0x0000)     /*!< voltage threshold around 1.8 V */
//#define PWR_CTRL_PLS1                         ((uint16_t)(1 << PLS_OFFSET))     /*!< voltage threshold around 2.1 V */
//#define PWR_CTRL_PLS2                         ((uint16_t)(2 << PLS_OFFSET))     /*!< voltage threshold around 2.25 V */
//#define PWR_CTRL_PLS3                         ((uint16_t)(3 << PLS_OFFSET))     /*!< voltage threshold around 2.4 V */
//#define PWR_CTRL_PLS4                         ((uint16_t)(4 << PLS_OFFSET))     /*!< voltage threshold around 2.55 V */
//#define PWR_CTRL_PLS5                         ((uint16_t)(5 << PLS_OFFSET))     /*!< voltage threshold around 2.7 V */
//#define PWR_CTRL_PLS6                         ((uint16_t)(6 << PLS_OFFSET))     /*!< voltage threshold around 2.85 V */
//#define PWR_CTRL_PLS7                         ((uint16_t)(7 << PLS_OFFSET))     /*!< voltage threshold around 2.95 V */
//#define PWR_CTRL_PLS8                         ((uint16_t)(8 << PLS_OFFSET))     /*!< external input analog voltage PVD_IN (compared internally to VREFINT) */

#define PWR_CTRL_PDR                           ((uint16_t)0x0200)     /*!< Adjust the voltage of VDDD PDR on stop mode */
#define PWR_CTRL_STPPLSEN                    ((uint16_t)0x0400)     /*!< When this bit is set, further reduce power consumption on stop mode . */
/********************  Bit definition for PWR_CTRLSTS register  ********************/
#define PWR_CTRLSTS_WKUPF                     ((uint16_t)0x0001)     /*!< on DBGPD mode,wakeup pin occurs wakeup event,hardware setup*/
#define PWR_CTRLSTS_DBGPDF                    ((uint16_t)0x0002)     /*!< DBGPD state flag */
#define PWR_CTRLSTS_PVDO                      ((uint16_t)0x0004)     /*!< Power voltage detector output */
#define PWR_CTRLSTS_WKUP0EN                   ((uint16_t)0x0100)     /*!< wakeup enable ,PA0  */
#define PWR_CTRLSTS_WKUP1EN                   ((uint16_t)0x0200)     /*!< wakeup enable ,PC13  */
#define PWR_CTRLSTS_WKUP2EN                   ((uint16_t)0x0400)     /*!< wakeup enable ,PA2  */
#define PWR_CTRLSTS_WKUPPOL                   ((uint16_t)0x0800)     /*!< wakeup polarity select  */
/********************  Bit definition for PWR_CTRL2 register  ********************/
#define PWR_CTRL2_IWDGRSTEN                   ((uint16_t)0x0400)     /*!< IWDG reset enable */
/********************  Bit definition for PWR_CTRL3 register  ********************/
#define PWR_CTRL3_LSIEN                       ((uint16_t)0x0080)     /*!< when enter STOP mode,LSI control mode selection */
/********************  Bit definition for PWR_CTRL4 register  ********************/
#define PWR_CTRL4_FLHWKUP                       ((uint16_t)0x0001)     /*!< FLASH wakeup mode selection,normal mode or quickly mode */
#define PWR_CTRL4_STBFLH                        ((uint16_t)0x0002)      /*!< FLASH STANDBY mode enable */
#define PWR_CTRL4_LPRUNEN                         ((uint16_t)0x0010)     /*!< Low-power run mode enable */
#define PWR_CTRL4_LPRUNFLH                        ((uint16_t)0x0020)     /*!< when enter LPRUN mode,FLASH work mode selection */
#define PWR_CTRL4_LPRUNSTS                        ((uint16_t)0x0040)     /*!< Low-power run state */
/********************  Bit definition for PWR_CTRL5 register  ********************/
#define PWR_CTRL5_SLPMRSEL                        ((uint16_t)0x000C)     /*!< when enter STOP mode,MR voltage selection */
#define PWR_CTRL5_SLPMRSEL_1V5                    ((uint16_t)0x0004)     /*!< when enter STOP mode,MR voltage select 1.5V*/
#define PWR_CTRL5_SLPMRSEL_1V2                    ((uint16_t)0x000C)     /*!< when enter STOP mode,MR voltage select 1.2V*/
#define PWR_CTRL5_SLPMRSEL_1V0                    ((uint16_t)0x0008)     /*!< when enter STOP mode,MR voltage select 1.0V*/
/********************  Bit definition for PWR_CTRL6 register  ********************/
#define PWR_CTRL6_SLPMREN                         ((uint16_t)0x000C)     /*!< when enter STOP mode,MR voltage selection output enable*/
#define PWR_CTRL6_SLPMREN_1V5                     ((uint16_t)0x0000)     /*!< when enter STOP mode,MR voltage select 1.5V output*/
#define PWR_CTRL6_SLPMREN_BY                      ((uint16_t)0x000C)     /*!< when enter STOP mode,MR voltage select output from SLPMRSEL*/

/********************  Bit definition for PWR_DBGCTRL register  ********************/
#define PWR_DBGCTRL_STOP                              ((uint32_t)0x00000002)     /*!< Debug on stop mode enable*/
#define PWR_DBGCTRL_PD                                ((uint32_t)0x00000004)     /*!< Debug on PD mode enable*/
#define PWR_DBGCTRL_IWDGSTP                           ((uint32_t)0x00000100)     /*!< when enter debug mode,IWDG work mode selection*/
#define PWR_DBGCTRL_WWDGSTP                           ((uint32_t)0x00000200)     /*!< when enter debug mode,WWDG work mode selection*/
#define PWR_DBGCTRL_TIM1STP                           ((uint32_t)0x00000400)     /*!< when enter debug mode,TIM1 work mode selection*/
#define PWR_DBGCTRL_TIM2STP                           ((uint32_t)0x00000800)     /*!< when enter debug mode,TIM2 work mode selection*/
#define PWR_DBGCTRL_TIM3STP                           ((uint32_t)0x00001000)     /*!< when enter debug mode,TIM3 work mode selection*/

