xbenkozx/RAZ-RE/Firmware/keil-mdk/firmware/CMSIS/device/n32g031.h
/******************  Bit definition for USART_CTRL3 register  *******************/
#define USART_CTRL3_ERRIEN  ((uint16_t)0x0001) /*!< Error Interrupt Enable */
#define USART_CTRL3_IRDAMEN ((uint16_t)0x0002) /*!< IrDA mode Enable */
#define USART_CTRL3_IRDALP  ((uint16_t)0x0004) /*!< IrDA Low-Power */
#define USART_CTRL3_HDMEN   ((uint16_t)0x0008) /*!< Half-Duplex Selection */
#define USART_CTRL3_SCNACK  ((uint16_t)0x0010) /*!< Smartcard NACK enable */
#define USART_CTRL3_SCMEN   ((uint16_t)0x0020) /*!< Smartcard mode enable */
#define USART_CTRL3_DMARXEN ((uint16_t)0x0040) /*!< DMA Enable Receiver */
#define USART_CTRL3_DMATXEN ((uint16_t)0x0080) /*!< DMA Enable Transmitter */
#define USART_CTRL3_RTSEN   ((uint16_t)0x0100) /*!< RTS Enable */
#define USART_CTRL3_CTSEN   ((uint16_t)0x0200) /*!< CTS Enable */
#define USART_CTRL3_CTSIEN  ((uint16_t)0x0400) /*!< CTS Interrupt Enable */

/******************  Bit definition for USART_GTP register  ******************/
#define USART_GTP_PSCV   ((uint16_t)0x00FF) /*!< PSC[7:0] bits (Prescaler value) */
#define USART_GTP_PSCV_0 ((uint16_t)0x0001) /*!< Bit 0 */
#define USART_GTP_PSCV_1 ((uint16_t)0x0002) /*!< Bit 1 */
#define USART_GTP_PSCV_2 ((uint16_t)0x0004) /*!< Bit 2 */
#define USART_GTP_PSCV_3 ((uint16_t)0x0008) /*!< Bit 3 */
#define USART_GTP_PSCV_4 ((uint16_t)0x0010) /*!< Bit 4 */
#define USART_GTP_PSCV_5 ((uint16_t)0x0020) /*!< Bit 5 */
#define USART_GTP_PSCV_6 ((uint16_t)0x0040) /*!< Bit 6 */
#define USART_GTP_PSCV_7 ((uint16_t)0x0080) /*!< Bit 7 */

#define USART_GTP_GTV ((uint16_t)0xFF00) /*!< Guard time value */

/******************************************************************************/
/*                                                                            */
/*          Low-power Universal Asynchronous Receiver Transmitter             */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for LPUART_STS register  ******************/
#define LPUART_STS_PEF      ((uint16_t)0x0001) /*!< Parity Check Error Flag */
#define LPUART_STS_TXC      ((uint16_t)0x0002) /*!< TX Complete Flag */
#define LPUART_STS_FIFO_OV  ((uint16_t)0x0004) /*!< FIFO Overflow Flag */
#define LPUART_STS_FIFO_FU  ((uint16_t)0x0008) /*!< FIFO Full Flag */
#define LPUART_STS_FIFO_HF  ((uint16_t)0x0010) /*!< FIFO Half Full Flag */
#define LPUART_STS_FIFO_NE  ((uint16_t)0x0020) /*!< FIFO Non-Empty Flag */
#define LPUART_STS_CTS      ((uint16_t)0x0040) /*!< Clear to Send (Hardware Flow Control) Flag */
#define LPUART_STS_WUF      ((uint16_t)0x0080) /*!< Wakeup from Stop mode Flag */
#define LPUART_STS_NF       ((uint16_t)0x0100) /*!< Noise Detected Flag */

/******************  Bit definition for LPUART_INTEN register  ******************/
#define LPUART_INTEN_PEIE       ((uint8_t)0x01) /*!< Parity Check Error Interrupt Enable */
#define LPUART_INTEN_TXCIE      ((uint8_t)0x02) /*!< TX Complete Interrupt Enable */
#define LPUART_INTEN_FIFO_OVIE  ((uint8_t)0x04) /*!< FIFO Overflow Interrupt Enable */
#define LPUART_INTEN_FIFO_FUIE  ((uint8_t)0x08) /*!< FIFO Full Interrupt Enable*/
#define LPUART_INTEN_FIFO_HFIE  ((uint8_t)0x10) /*!< FIFO Half Full Interrupt Enable */
#define LPUART_INTEN_FIFO_NEIE  ((uint8_t)0x20) /*!< FIFO Non-Empty Interrupt Enable */
#define LPUART_INTEN_WUFIE      ((uint8_t)0x40) /*!< Wakeup Interrupt Enable */

/******************  Bit definition for LPUART_CTRL register  ******************/
#define LPUART_CTRL_PSEL      ((uint16_t)0x0001) /*!< Odd Parity Bit Enable */
#define LPUART_CTRL_TXEN      ((uint16_t)0x0002) /*!< TX Enable */
#define LPUART_CTRL_FLUSH     ((uint16_t)0x0004) /*!< Flush Receiver FIFO Enable */
#define LPUART_CTRL_PCDIS     ((uint16_t)0x0008) /*!< Parity Control Disable */
#define LPUART_CTRL_LOOPBACK  ((uint16_t)0x0010) /*!< Loop Back Self-Test */
#define LPUART_CTRL_DMA_TXEN  ((uint16_t)0x0020) /*!< DMA TX Request Enable */
#define LPUART_CTRL_DMA_RXEN  ((uint16_t)0x0040) /*!< DMA RX Request Enable */
#define LPUART_CTRL_WUSTP     ((uint16_t)0x0080) /*!< LPUART Wakeup Enable in Stop mode */
#define LPUART_CTRL_RTS_THSEL ((uint16_t)0x0300) /*!< RTS Threshold Selection */
#define LPUART_CTRL_CTSEN     ((uint16_t)0x0400) /*!< Hardware Flow Control TX Enable */
#define LPUART_CTRL_RTSEN     ((uint16_t)0x0800) /*!< Hardware Flow Control RX Enable */
#define LPUART_CTRL_WUSEL     ((uint16_t)0x3000) /*!< Wakeup Event Selection */
#define LPUART_CTRL_SMPCNT    ((uint16_t)0x4000) /*!< Specify the Sampling Method */

/******************  Bit definition for LPUART_BRCFG1 register  ******************/
#define LPUART_BRCFG1_INTEGER  ((uint16_t)0xFFFF) /*!< Baud Rate Parameter Configeration Register1: Fraction */

/******************  Bit definition for LPUART_DAT register  ******************/
#define LPUART_DAT_DAT  ((uint8_t)0xFF) /*!< Data Register */

/******************  Bit definition for LPUART_BRCFG2 register  ******************/
#define LPUART_BRCFG2_DECIMAL  ((uint8_t)0xFF) /*!< Baud Rate Parameter Configeration Register2: Mantissa */

/******************  Bit definition for LPUART_WUDAT register  ******************/
#define LPUART_WUDAT_WUDAT  ((uint32_t)0xFFFFFFFF) /*!< Data Register */

/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                                   Beeper                                   */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for BEEPER_CTRL register  ******************/
#define BEEPER_CTRL_BUZZER_CLKSEL      ((uint32_t)0x0000001F) /*!< Buzzer output clock select */
#define BEEPER_CTRL_BUZZER_EN          ((uint32_t)0x00000020) /*!< Buzzer enable */
#define BEEPER_CTRL_INV_EN             ((uint32_t)0x00000040) /*!< Buzzer inverter enable */

/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                                    HDIV                                    */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for HDIV_CTRLSTS register  ******************/
#define HDIV_CTRLSTS_HDIVEN            ((uint32_t)0x00000001) /*!< HDIV enable */
#define HDIV_CTRLSTS_HDIVSTART         ((uint32_t)0x00000002) /*!< HDIV start */
#define HDIV_CTRLSTS_HDIVBUSY          ((uint32_t)0x00000004) /*!< HDIV busy flag */
#define HDIV_CTRLSTS_HDIVDF            ((uint32_t)0x00000008) /*!< HDIV dong flag */
#define HDIV_CTRLSTS_HDIVIF            ((uint32_t)0x00000010) /*!< HDIV interrupt flag */
#define HDIV_CTRLSTS_HDIVIEN           ((uint32_t)0x00000020) /*!< HDIV interrupt enable */

/******************  Bit definition for HDIV_DIVIDEND register  ******************/
#define HDIV_DIVIDEND_DIVIDEND         ((uint32_t)0xFFFFFFFF) /*!< 32bit unsigned interger dividend */

/******************  Bit definition for HDIV_DIVISOR register  ******************/
#define HDIV_DIVISOR_DIVISOR           ((uint32_t)0xFFFFFFFF) /*!< 32bit unsigned interger divisor */

/******************  Bit definition for HDIV_QUOTIENT register  ******************/
#define HDIV_QUOTIENT_QUOTIENT         ((uint32_t)0xFFFFFFFF) /*!< Quotient calculated by the divider */

/******************  Bit definition for HDIV_REMAINDER register  ******************/
#define HDIV_REMAINDER_REMAINDER       ((uint32_t)0xFFFFFFFF) /*!< Remainder calculated by the divider */

/******************  Bit definition for HDIV_DIVBY0 register  ******************/
#define HDIV_DIVBY0_DIVBY0             ((uint32_t)0x00000001) /*!< The divisor is 0 flag */

/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                     Square Root Calculations(SQRT)                         */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for SQRT_CTRLSTS register  ******************/
#define SQRT_CTRLSTS_SQRTEN            ((uint32_t)0x00000001) /*!< SQRT enable */
#define SQRT_CTRLSTS_SQRTSTART         ((uint32_t)0x00000002) /*!< SQRT start */
#define SQRT_CTRLSTS_SQRTBUSY          ((uint32_t)0x00000004) /*!< SQRT busy flag */
#define SQRT_CTRLSTS_SQRTDF            ((uint32_t)0x00000008) /*!< SQRT dong flag */
#define SQRT_CTRLSTS_SQRTIF            ((uint32_t)0x00000010) /*!< SQRT interrupt flag */
#define SQRT_CTRLSTS_SQRTIEN           ((uint32_t)0x00000020) /*!< SQRT interrupt enable */

/******************  Bit definition for SQRT_RADICANT register  ******************/
#define SQRT_RADICANT_RADICANT         ((uint32_t)0xFFFFFFFF) /*!< 32bit unsigned interger squared */

/******************  Bit definition for SQRT_ROOT register  ******************/
#define SQRT_ROOT_ROOT                 ((uint32_t)0x0000FFFF) /*!< 16bit Square root output */

/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                      FLASH and Option Bytes Registers                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_ACR register  ******************/
#define FLASH_AC_LATENCY   ((uint32_t)0x00000003) /*!< LATENCY[2:0] bits (Latency) */
#define FLASH_AC_LATENCY_0 ((uint32_t)0x00000000) /*!< Bit 0 = 0 */
#define FLASH_AC_LATENCY_1 ((uint32_t)0x00000001) /*!< Bit 0 = 1 */
#define FLASH_AC_LATENCY_2 ((uint32_t)0x00000002) /*!< Bit 0 = 0; Bit 1 = 1 */

